erp3l/src/Documents/КорректировкаЛимитов/КорректировкаЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЛимитов</name>
  <basedOn>Document.ВерсияСоглашенияКоммерческийДоговор</basedOn>
  <basedOn>Document.ВерсияСоглашенияАккредитив</basedOn>
  <basedOn>Document.ВерсияСоглашенияБанковскаяГарантия</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютноПроцентныйСвоп</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютныйСвоп</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютныйФорвард</basedOn>
  <basedOn>Document.ВерсияСоглашенияДепозит</basedOn>
  <basedOn>Document.ВерсияСоглашенияКредит</basedOn>
  <basedOn>Document.УдалитьВерсияСоглашенияЛизинг</basedOn>
  <registerRecords>AccumulationRegister.ЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодЛимитирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДляОбеспечения</name>
    <type>
      <types>DefinedType.ОснованияДокументаЗаявкаНаКорректировкуЛимитов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>DefinedType.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Обеспечено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованияДокументаКорректировкаЛимитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Требуется</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>КОбеспечению</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбеспечитьЗаСчет</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийКорректировкаЛимитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/КорректировкаЛимитов/Forms/ФормаПодбораУстановленныхЛимитов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодЛимитированияНачало = НачалоГода(Параметры.ГодЛимитирования);
	ПериодЛимитированияОкончание = НачалоДня(КонецГода(ПериодЛимитированияНачало));
	Валюта = Параметры.Валюта;
	ВидБюджета = Параметры.ВидБюджета;
	
	//
	ПараметрыЛимитирования = ПолучитьПараметрыЛимитирования(ВидБюджета, ПериодЛимитированияНачало);
	Периодичность = ПараметрыЛимитирования.Периодичность;
	Предназначение = ПараметрыЛимитирования.Предназначение;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидБюджета", ВидБюджета);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Валюта", Валюта);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаНачала", ПериодЛимитированияНачало);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаОкончания", ПериодЛимитированияОкончание);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Предназначение", Предназначение);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Периодичность", Периодичность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//  ПараметрыВыбора для периода лимитирования
	Элемент = Элементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент2Значение;
	
	ПараметрыВыбора = Новый Массив();
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Произвольный", Ложь));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Периодичность", Периодичность));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТолькоПериодыГода", ПериодЛимитированияНачало));
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура ВидБюджетаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьЛимитированияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПериодЛимитированияНачалоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПериодЛимитированияОкончаниеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыЛимитирования(ВидБюджета, ПериодЛимитированияНачало)
	
	Результат = Новый Структура("ВидБюджета, Предназначение, Периодичность", 
		ВидБюджета, Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПустаяСсылка(), Перечисления.Периодичность.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидБюджета", ВидБюджета);
	Запрос.УстановитьПараметр("НаДату", ПериодЛимитированияНачало);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыЛимитированияСрезПоследних.ВидБюджета КАК ВидБюджета,
	|	ПараметрыЛимитированияСрезПоследних.ВидБюджета.Предназначение КАК Предназначение,
	|	ПараметрыЛимитированияСрезПоследних.ПериодичностьЛимитирования КАК Периодичность
	|ИЗ
	|	РегистрСведений.ПараметрыЛимитирования.СрезПоследних(&НаДату, ВидБюджета = &ВидБюджета) КАК ПараметрыЛимитированияСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ДанныеВыбора)
	Результат = Новый Структура;
	Результат.Вставить("ВидБюджета");
	Результат.Вставить("Предназначение");
	Результат.Вставить("ПериодЛимитирования");
	Результат.Вставить("Валюта");
	Результат.Вставить("ЦФО");
	Результат.Вставить("Проект");
	Результат.Вставить("СтатьяБюджета");
	Результат.Вставить("Аналитика1");
	Результат.Вставить("Аналитика2");
	Результат.Вставить("Аналитика3");
	Результат.Вставить("Аналитика4");
	Результат.Вставить("Аналитика5");
	Результат.Вставить("Аналитика6");
	Результат.Вставить("Свободно");
	ЗаполнитьЗначенияСвойств(Результат, ДанныеВыбора);
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти
